{* Шаблон страницы заглушки на случай запрета доступа к странице *}
<div class="row">
	<div class="col-sm-12">
		<h1>Извините...</h1>
		<p class="bg-info">
			К этой странице сейчас нет доступа.
			<br />Когда и как получить доступ к этой странице, Вы сможете узнать у администрации сайта.
			<br />Нам искрене жаль за это недоразумение.
		</p>
		<p class="well well-sm small">
			Вы можете вернуться на <a href="/">главную страницу</a> сайта.
			<br />Или Вы так же можете <a href="javascript:history.back(1)">вернуться</a> на страницу с которой сюда попали.
		</p>
	</div>
</div>