<?php
/*=========================================================
|	This script was developed by alex Roosso .
|	Title: RooCMS Config File
|	Author:	alex Roosso
|	Copyright: 2010-2011 (c) RooCMS. 
|	Web: http://www.roocms.com
|	All rights reserved.
|----------------------------------------------------------
|	This program is free software; you can redistribute it and/or modify
|	it under the terms of the GNU General Public License as published by
|	the Free Software Foundation; either version 2 of the License, or
|	(at your option) any later version.
|	
|	Данное программное обеспечение является свободным и распространяется
|	по лицензии Фонда Свободного ПО - GNU General Public License версия 2.
|	При любом использовании данного ПО вы должны соблюдать все условия
|	лицензии.
|----------------------------------------------------------
|	Build: 			22:35 05.11.2010
|	Last Build: 	2:18 29.10.2011
|	Version file:	1.00 build 11
=========================================================*/

//#########################################################
// Anti Hack
//---------------------------------------------------------
if(!defined('RooCMS')) die('Access Denied');
//#########################################################


//#########################################################
//	Настройки подключения к Базе Данных MySQL
//---------------------------------------------------------
$db_info = array();
//---------------------------------------------------------
$db_info['host']		=	'localhost';						#	Хост Базы Данных
$db_info['user']		=	'';									#	Имя пользователя Базы Данных
$db_info['pass']		=	'';									#	Пароль пользователя Базы Данных
$db_info['database']	=	'';									#	Название Базы с данными
//#########################################################


//#########################################################
//	Логин и пароль Администратора
//---------------------------------------------------------
$adm = array();
//---------------------------------------------------------
$adm['login'] = "";												#	Логин Администратора
$adm['passw'] = "";												#	Пароль Администратора
//#########################################################


//#########################################################
//	Различные параметры
//---------------------------------------------------------
$var = array();
//---------------------------------------------------------
$var['title'] 		= 	"";										#	Заголовок сайта (используется в случае сбоя БД)
$var['domain']		=	"";										#	Является значением по умолчаню и используется в случае сбоя БД
$var['sysemail']	= 	"";										#	Системный почтовый адрес, для уведомления о сбоях в БД
//#########################################################



#!		Далее ниже, ничего менять не следует.

//#########################################################
//	includes engine files 
//---------------------------------------------------------
//	include global settngs
require_once "set.cfg.php";
//#########################################################


//#########################################################
//	include constants
//---------------------------------------------------------
require_once "defines.php";
//#########################################################

?>